# Pandas groupby cheatsheet

<img src="https://camo.githubusercontent.com/d9e874bf1571c223a5b4e382e68080820e35dfc81350d0b29c7f82f52962a2b4/68747470733a2f2f692e696d6775722e636f6d2f77506e574235652e6a7067" alt="groups of pandas" width="400"/>

usefull links: 
* [video](https://www.youtube.com/watch?v=ipoSjrN0oh0&ab_channel=ChartExplorers)
* [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)
* signature:  
 `DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=_NoDefault.no_default, squeeze=_NoDefault.no_default, observed=False, dropna=True)[source]`

In [4]:
import pandas as pd

In [21]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 9, 34, 31, 72, 76],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']}
    ,
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
df

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,9,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,34,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,31,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,72,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,76,159,32,street4

## groupby single column
We want to groupby class and have information height (max)

In [22]:
df.groupby("class")["height"].max()

class
V     192
VI    186
Name: height, dtype: int64

##  groupby multiple columns
we want to groupby class and have information about height and weight (min)

In [23]:
df.groupby("class")[["height", "weight"]].min()

       height  weight
class
V         151      31
VI        159      30

## groupby multiple groups
We want to groupby class and school_code and have information about height  
!!! Return multi-index

In [24]:
df.groupby(['class', 'school_code'])["height"].mean()

class  school_code
V      s001           173.0
       s002           171.5
VI     s001           167.0
       s003           186.0
       s004           159.0
Name: height, dtype: float64

## groupby multiple groups as columnn(no multi-index)
We want to groupby class and school_code and have information about height

In [25]:
df.groupby(['class', 'school_code'], as_index=False)["height"].mean()

  class school_code  height
0     V        s001   173.0
1     V        s002   171.5
2    VI        s001   167.0
3    VI        s003   186.0
4    VI        s004   159.0

## groupy multiple operations
We want to groupby class and have sum & mean information about height

In [26]:
df.groupby(["class"])["height"].agg(["sum", "mean"])

       sum        mean
class
V      516  172.000000
VI     512  170.666667

## groupby for too wide cateogies
Age for instance is not usefull as group, dividing this value in subgroup before grouping can be interesting

In [28]:
df["age_cat"] = pd.cut(df['age'], bins=3, labels=('young', "adult", "elder"))
df

,school_code,class,name,date_Of_Birth,age,height,weight,address,age_cat
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1,young
S2,s002,V,Gino Mcneill,17/05/2002,9,192,32,street2,young
S3,s003,VI,Ryan Parkes,16/02/1999,34,186,33,street3,adult
S4,s001,VI,Eesha Hinton,25/09/1998,31,167,30,street1,young
S5,s002,V,Gino Mcneill,11/05/2002,72,151,31,street2,elder
S6,s004,VI,David Parkes,15/09/1997,76,159,32,street4,elder

## Operations
- .min()
- .max()
- .mean()
- .median()
- .count()
- .apply()
- .agg()
- .transform()
- .describe(): count, mean, std, min, max, percentiles